app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "date", "summary", "review", "book_id", "created_at", "updated_at", "cover_photo_url") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)