app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("user_name", "body", "book_id", "created_at", "updated_at", "rating") VALUES (?, ?, ?, ?, ?, ?)  [["user_name", "shaffan"], ["body", "Tihs book changed my life! :D"], ["book_id", nil], ["created_at", "2023-01-26 01:32:12.218857"], ["updated_at", "2023-01-26 01:32:12.218857"], ["rating", nil]]